docs/documentation/library/data/array.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-29 Tue 15:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modulus Libraries: Array</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../../../modulus-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Modulus Libraries: Array</h1>
<div style="text-align:right">
<p>
<a href="../../../index.html">Modulus</a> / <a href="../../index.html">Documentation</a> / <a href="../index.html">Library</a> / <a href="index.html">Data Structures</a> / Array
</p>
</div>

<div id="outline-container-orgd3b2fd9" class="outline-2">
<h2 id="orgd3b2fd9">Overview</h2>
</div>
<div id="outline-container-orgf7d42ba" class="outline-2">
<h2 id="orgf7d42ba">Outline</h2>
<div class="outline-text-2" id="text-orgf7d42ba">
<ul class="org-ul">
<li><code>array</code>
<ul class="org-ul">
<li><code>Array [A]</code>
<ul class="org-ul">
<li><code>cons</code></li>
<li><code>nil</code></li>
</ul></li>
<li><code>array-monad</code></li>
<li><code>array-seq</code></li>
<li><code>array-monoid</code></li>
<li><code>array-operators</code></li>
</ul></li>
</ul>
</div>
</div>



<div id="outline-container-org0590640" class="outline-2">
<h2 id="org0590640">List Seq</h2>
<div class="outline-text-2" id="text-org0590640">
<p>
Implementation of the [Seq] signature for lists. [Seq] is a generalization
[Container] for data-structures where the elements have some kind of ordering.
</p>
</div>

<div id="outline-container-org877a088" class="outline-3">
<h3 id="org877a088">Monad</h3>
<div class="outline-text-3" id="text-org877a088">
</div>
<div id="outline-container-org3822e1f" class="outline-4">
<h4 id="org3822e1f">Functor</h4>
<div class="outline-text-4" id="text-org3822e1f">
<p>
Array is a <code>functor</code>, and so implements <code>map</code>.
</p>

<p>
Map (binary <code>¨</code>) 
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; map <span style="color: #807f96;">(</span>+ <span style="color: #cea2ca;">1</span><span style="color: #807f96;">)</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org616af41" class="outline-4">
<h4 id="org616af41">Applicative</h4>
<div class="outline-text-4" id="text-org616af41">
<p>
Array is an applicative, and so implements <code>pure</code> and <code>apply</code>.
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; pure <span style="color: #cea2ca;">3</span> 
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-modulus">&gt; apply <span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">(</span>+1<span style="color: #9d81ba;">)</span> <span style="color: #9d81ba;">(</span>-1<span style="color: #9d81ba;">)</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">0</span> <span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org86ec69a" class="outline-4">
<h4 id="org86ec69a">Monad</h4>
<div class="outline-text-4" id="text-org86ec69a">
<p>
Monad 
</p>

<p>
Join
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; join <span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">7</span> <span style="color: #cea2ca;">8</span> <span style="color: #cea2ca;">9</span><span style="color: #9d81ba;">&#10648;</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span> <span style="color: #cea2ca;">7</span> <span style="color: #cea2ca;">8</span> <span style="color: #cea2ca;">9</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<p>
Bind
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span> &gt;&gt;= <span style="color: #807f96;">(</span><span style="color: #738FD7;">&#955;</span> <span style="color: #9d81ba;">[</span>x<span style="color: #9d81ba;">]</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #4d9391;">(</span>x + <span style="color: #cea2ca;">1</span><span style="color: #4d9391;">)</span> <span style="color: #4d9391;">(</span>x + <span style="color: #cea2ca;">2</span><span style="color: #4d9391;">)</span> <span style="color: #4d9391;">(</span>x + <span style="color: #cea2ca;">3</span><span style="color: #4d9391;">)</span><span style="color: #9d81ba;">&#10648;</span><span style="color: #807f96;">)</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span> <span style="color: #cea2ca;">7</span> <span style="color: #cea2ca;">8</span> <span style="color: #cea2ca;">9</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8cb3d1c" class="outline-3">
<h3 id="org8cb3d1c">Monoid</h3>
<div class="outline-text-3" id="text-org8cb3d1c">
</div>
<div id="outline-container-org475e615" class="outline-4">
<h4 id="org475e615">Magma</h4>
<div class="outline-text-4" id="text-org475e615">
<p>
<b>append/⋅</b>
</p>
</div>
</div>

<div id="outline-container-org97da76d" class="outline-4">
<h4 id="org97da76d">Semigroup</h4>
<div class="outline-text-4" id="text-org97da76d">
<ul class="org-ul">
<li>assoc</li>
</ul>
</div>
</div>

<div id="outline-container-orgae00afd" class="outline-4">
<h4 id="orgae00afd">Monoid</h4>
<div class="outline-text-4" id="text-orgae00afd">
<ul class="org-ul">
<li>id</li>
</ul>
<p>
<b>empty/⦗⦘</b>
</p>
</div>
</div>

<div id="outline-container-org1c9850a" class="outline-4">
<h4 id="org1c9850a">Group</h4>
<div class="outline-text-4" id="text-org1c9850a">
<ul class="org-ul">
<li>invertibility</li>
</ul>
<p>
<b>append/⋅</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org1ee8f9c" class="outline-3">
<h3 id="org1ee8f9c">Seq</h3>
<div class="outline-text-3" id="text-org1ee8f9c">
<p>
<b>insert</b>
</p>

<p>
<b>find</b>
</p>

<p>
<b>fold</b>
</p>

<p>
<b>scan</b>
</p>

<p>
<b>index</b>
</p>

<p>
<b>outer product</b>
</p>

<p>
<b>inner product</b>
</p>

<p>
<b>filter</b>
</p>

<p>
<b>stencil/mask</b>
</p>

<p>
<b>join</b>
</p>

<p>
<b>take</b>
</p>

<p>
<b>drop</b>
</p>
</div>
</div>
</div>


<div id="outline-container-org9bd1e00" class="outline-2">
<h2 id="org9bd1e00">List Monoid</h2>
<div class="outline-text-2" id="text-org9bd1e00">
<p>
Implementation of the [monoid] signature for lists. Note that [monoid] is a
supertype of [groupoid] and [magma]. 
</p>

<p>
<b>Append, ⋅</b>. <code>append x y</code>  
</p>

<p>
<b>empty, ⦗⦘</b> 
</p>
</div>
</div>

<div id="outline-container-org8054b1e" class="outline-2">
<h2 id="org8054b1e">List Internals</h2>
<div class="outline-text-2" id="text-org8054b1e">
<pre class="example">

</pre>
</div>
</div>
</div>
</body>
</html>
